BORDER_SIZE = 2
GAME_WIDTH = 960
GAME_HEIGHT = 480
COLUMN_WIDTH = 100
MENU_WIDTH = COLUMN_WIDTH * 3
WINDOW_WIDTH = GAME_WIDTH + MENU_WIDTH
WINDOW_HEIGHT = GAME_HEIGHT
PIXEL_SIZE = 8
FPS = 100
painted_colors = [
    ("Красный", (255, 0, 0)),
    ("Красно-оранжевый", (255, 75, 0)),
    ("Оранжевый", (255, 150, 0)),
    ("Оранжево-жёлтый", (255, 200, 0)),
    ("Жёлтый", (255, 255, 0)),
    ("Салатовый", (200, 255, 0)),
    ("Зелёный", (100, 255, 0)),
    ("Изумрудный", (0, 255, 75)),
    ("Бирюзовый", (0, 255, 150)),
    ("Морской", (0, 255, 200)),
    ("Голубой", (0, 255, 255)),
    ("Небесно-голубой", (0, 225, 255)),
    ("Лазурный", (0, 200, 255)),
    ("Светло-синий", (0, 150, 255)),
    ("Синий", (0, 100, 255)),
    ("Истинный синий", (0, 50, 255)),
    ("Черноморский-синий", (0, 0, 255)),
    ("Индиго", (100, 0, 255)),
    ("Фиолетовый", (150, 0, 255)),
    ("Пурпурный", (200, 0, 255)),
    ("Розовый", (255, 0, 150)),
    ("Алый", (255, 0, 100)),
    ("Белый", (255, 255, 255)),
    ("Светло-серый", (185, 185, 180)),
    ("Серый", (150, 150, 150)),
    ("Тёмно-серый", (100, 100, 100)),
    ("Чёрный", (50, 50, 55)),
    ("Тёмно-коричневый", (100, 50, 25)),
    ("Коричневый", (150, 100, 50)),
    ("Светло-коричневый", (200, 150, 100)),
]

TOOL_SUBTYPES = {
    "Рисование": ["Круглая кисть", "Квадратная кисть", "Случайная кисть", "Карандаш", "Ластик"],
    "Выбор цвета": painted_colors
}

TOOLS = ["Рисование", "Выбор цвета"]
